abelykh0/stm32h7uvc/Main/usbd_video.c
  /* Class-specific VS Header Descriptor (Input) */
  VIDEO_VS_IF_IN_HEADER_DESC_SIZE,               /* bLength */
  CS_INTERFACE,                                  /* bDescriptorType */
  VS_INPUT_HEADER,                               /* bDescriptorSubtype */
  0x01,                                          /* bNumFormats: 1 format descriptor is used */
  VC_HEADER_SIZE,
  0x00,                                          /* Total size of Video Control Specific Descriptors */
  UVC_IN_EP,                                     /* bEndPointAddress: In endpoint is used for the alternate setting */
  0x00,                                          /* bmInfo: dynamic format change not supported */
  0x02,                                          /* bTerminalLink: output to terminal ID 2 */
  0x00,                                          /* bStillCaptureMethod: not supported */
  0x00,                                          /* bTriggerSupport: not supported */
  0x00,                                          /* bTriggerUsage: not supported */
  0x01,                                          /* bControlSize: 1 byte field size */
  0x00,                                          /* bmaControls: No specific controls used */

  /* Payload Format Descriptor */
  VS_FORMAT_DESC_SIZE,                           /* blength */
  CS_INTERFACE,                                  /* bDescriptorType */
  VS_FORMAT_SUBTYPE,                             /* bDescriptorSubType */
  0x01,                                          /* bFormatIndex */
  0x01,                                          /* bNumFrameDescriptor */
#ifdef USBD_UVC_FORMAT_UNCOMPRESSED
  DBVAL(UVC_UNCOMPRESSED_GUID),                  /* Giud Format: YUY2 {32595559-0000-0010-8000-00AA00389B71} */
  0x00, 0x00,
  0x10, 0x00,
  0x80, 0x00,
  0x00, 0xAA, 0x00, 0x38, 0x9B, 0x71,
  UVC_BITS_PER_PIXEL,                            /* bBitsPerPixel : Number of bits per pixel */
#else
  0x01,                                          /* bmFlags: FixedSizeSamples */
#endif /* USBD_UVC_FORMAT_UNCOMPRESSED */
  0x01,                                          /* bDefaultFrameIndex: default frame used is frame 1
                                                    (only one frame used) */
  0x00,                                          /* bAspectRatioX: not required by specification */
  0x00,                                          /* bAspectRatioY: not required by specification */
  0x00,                                          /* bInterlaceFlags: non interlaced stream */
  0x00,                                          /* bCopyProtect: no protection restrictions */

  /* Class-specific VS (Video Streaming) Frame Descriptor */
  VS_FRAME_DESC_SIZE,                            /* bLength */
  CS_INTERFACE,                                  /* bDescriptorType */
  VS_FRAME_SUBTYPE,                              /* bDescriptorSubType */
  0x01,                                          /* bFrameIndex */
#ifdef USBD_UVC_FORMAT_UNCOMPRESSED
  0x00,                                          /* bmCapabilities: no till image capture */
#else
  0x02,                                          /* bmCapabilities: fixed frame rate supported */
#endif /* USBD_UVC_FORMAT_UNCOMPRESSED */
  WBVAL(UVC_WIDTH),                              /* wWidth: Image Frame Width */
  WBVAL(UVC_HEIGHT),                             /* wHeight: Image Frame Height */
  DBVAL(UVC_MIN_BIT_RATE(UVC_CAM_FPS_FS)),       /* dwMinBitRate: Minimum supported bit rate in bits/s  */
  DBVAL(UVC_MAX_BIT_RATE(UVC_CAM_FPS_FS)),       /* dwMaxBitRate: Maximum supported bit rate in bits/s  */
  DBVAL(UVC_MAX_FRAME_SIZE),                     /* dwMaxVideoFrameBufSize: Maximum video frame size, in bytes */
  DBVAL(UVC_INTERVAL(UVC_CAM_FPS_FS)),           /* dwDefaultFrameInterval: following number of FPS */
  0x01,                                          /* bFrameIntervalType: Discrete frame interval type */
  DBVAL(UVC_INTERVAL(UVC_CAM_FPS_FS)),           /* dwMinFrameInterval: One supported value of interval (FPS) */

#ifdef USBD_UVC_FORMAT_UNCOMPRESSED
  /* Color Matching Descriptor */
  VS_COLOR_MATCHING_DESC_SIZE,                   /* bLength */
  CS_INTERFACE,                                  /* bDescriptorType: CS_INTERFACE */
  VS_COLORFORMAT,                                /* bDescriptorSubType: VS_COLORFORMAT */
  UVC_COLOR_PRIMARIE,                            /* bColorPrimarie: 1: BT.709, sRGB (default) */
  UVC_TFR_CHARACTERISTICS,                       /* bTransferCharacteristics: 1: BT.709 (default) */
  UVC_MATRIX_COEFFICIENTS,                       /* bMatrixCoefficients: 4: BT.601, (default) */
#endif /* USBD_UVC_FORMAT_UNCOMPRESSED */

  /* Standard VS Interface Descriptor  = interface 1, alternate setting 1 = data transfer mode  */
  USB_IF_DESC_SIZE,                              /* bLength */
  USB_DESC_TYPE_INTERFACE,                       /* bDescriptorType */
  UVC_VS_IF_NUM,                                 /* bInterfaceNumber */
  0x01,                                          /* bAlternateSetting */
  0x01,                                          /* bNumEndpoints: one endpoint is used */
  UVC_CC_VIDEO,                                  /* bInterfaceClass */
  SC_VIDEOSTREAMING,                             /* bInterfaceSubClass */
  PC_PROTOCOL_UNDEFINED,                         /* bInterfaceProtocol */
  0x00,                                          /* iInterface: index of string descriptor relative to this item */

  /* Standard VS (Video Streaming) data Endpoint */
  USB_EP_DESC_SIZE,                              /* bLength */
  USB_DESC_TYPE_ENDPOINT,                        /* bDescriptorType */
  UVC_IN_EP,                                     /* bEndpointAddress */
  0x05,                                          /* bmAttributes: ISO transfer */
  LOBYTE(UVC_ISO_FS_MPS),                        /* wMaxPacketSize */
  LOBYTE(UVC_ISO_FS_MPS),
  0x01,                                          /* bInterval: 1 frame interval */
};

